app/controllers/microposts_controller.rb

  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save
---
INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "Lorem ipsum"], ["created_at", Sun, 21 Aug 2016 10:02:33 UTC +00:00], ["updated_at", Sun, 21 Aug 2016 10:02:33 UTC +00:00], ["user_id", 1]]